### Instalar librerías y reiniciar kernel.

In [1]:
pip install mysql-connector

Collecting mysql-connector
  Downloading https://files.pythonhosted.org/packages/28/04/e40098f3730e75bbe36a338926f566ea803550a34fb50535499f4fc4787a/mysql-connector-2.2.9.tar.gz (11.9MB)
     |████████████████████████████████| 11.9MB 7.2MB/s
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py) ... done
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp36-cp36m-linux_x86_64.whl size=247950 sha256=f28f51ddfc0b4ebea159638e8c298521abe3ce8a1cb8373b06d5b1c6345fbcab
  Stored in directory: /root/.cache/pip/wheels/8c/83/a1/f8b6d4bb1bd6208bbde1608bbfa7557504bed9eaf2ecf8c175
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [2]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (1.1.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas) (2018.9)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.6/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

### Importaciones

In [5]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import inspect
from sqlalchemy import *
import json

### Crear acceso a engine de mysql e inspeccionar.

In [ ]:
engine = create_engine('mysql+mysqlconnector://test:test123@db/test', echo = True)

In [ ]:
pd.read_sql("select current_date", con=engine)

In [ ]:
inspector = inspect(engine)
schemas = inspector.get_schema_names()

for schema in schemas:
    print("schema: %s" % schema)
    for table_name in inspector.get_table_names(schema=schema):
        for column in inspector.get_columns(table_name, schema=schema):
            print("Column: %s" % column)

In [ ]:
print(engine.table_names())

# ETL 3

## Extraer

In [9]:
df = pd.read_csv('time_series_covid19_confirmed_global.csv')
df.head(3)

  Province/State Country/Region       Lat  ...  12/11/20  12/12/20  12/13/20
0            NaN    Afghanistan  33.93911  ...     48116     48229     48527
1            NaN        Albania  41.15330  ...     46863     47742     48530
2            NaN        Algeria  28.03390  ...     91121     91638     92102

[3 rows x 331 columns]

In [8]:
df.dtypes

Province/State     object
Country/Region     object
Lat               float64
Long              float64
1/22/20             int64
                   ...
12/9/20             int64
12/10/20            int64
12/11/20            int64
12/12/20            int64
12/13/20            int64
Length: 331, dtype: object

## Transformar

In [10]:
df = df.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'],
             var_name=["date"],
             value_name="cases")
df.head()

  Province/State Country/Region       Lat       Long     date  cases
0            NaN    Afghanistan  33.93911  67.709953  1/22/20      0
1            NaN        Albania  41.15330  20.168300  1/22/20      0
2            NaN        Algeria  28.03390   1.659600  1/22/20      0
3            NaN        Andorra  42.50630   1.521800  1/22/20      0
4            NaN         Angola -11.20270  17.873900  1/22/20      0

In [14]:
df['date'] =  pd.to_datetime(df['date'], format='%m/%d/%y')
df.head()

  Province/State Country/Region       Lat       Long       date  cases
0            NaN    Afghanistan  33.93911  67.709953 2020-01-22      0
1            NaN        Albania  41.15330  20.168300 2020-01-22      0
2            NaN        Algeria  28.03390   1.659600 2020-01-22      0
3            NaN        Andorra  42.50630   1.521800 2020-01-22      0
4            NaN         Angola -11.20270  17.873900 2020-01-22      0

In [15]:
pd.isna(df["Province/State"])

0        True
1        True
2        True
3        True
4        True
         ...
88612    True
88613    True
88614    True
88615    True
88616    True
Name: Province/State, Length: 88617, dtype: bool

In [16]:
u = df.select_dtypes(object)
df[u.columns] = u.apply(
    lambda x: x.str.encode('ascii', 'ignore').str.decode('ascii'))

## Load al engine

In [ ]:
create_table_query = pd.io.sql.get_schema(df.reset_index(), 'test.unconfirmed_transactions', con=engine)
print(create_table_query)
type(create_table_query)

In [ ]:
with open("unconfirmed_transactions.sql", "w") as text_file:
    text_file.write(create_table_query)

In [ ]:
if not engine.dialect.has_table(engine, "test.unconfirmed_transactions"):  # If table don't exist, Create.
    print("test.unconfirmed_transactions no existe")
    df.to_sql('unconfirmed_transactions', con=engine, schema="test", if_exists='append')

In [ ]:
with engine.begin() as transaction:
    transaction.execute('DELETE FROM test.unconfirmed_transactions')
    df.to_sql('unconfirmed_transactions', con=transaction, schema='test', if_exists='append', index=False)